public class HomeWork04 {
    public static void main(String[] args) {
        int a = 5;
        int b = 10;
       boolean sum = ((a+b)<=20 && (a+b)>=10);
        System.out.println(sum);
    }

    //Написать метод, принимающий на вход два числа, и проверяющий, что их сумма лежит в пределах
        //от 10 до 20 (включительно), если да – вернуть true, в противном случае – false;

}
